* Packages List

The table that follows this code block documents all of the packages
that I am currently using.  To update the list, just move the point
to anywhere inside the code block and type ~C-c C-c~ and answer "yes"
to the prompt.


#+BEGIN_SRC emacs-lisp :tangle no
  (defun got/gen-package-table ()
    "Generate a table of all installed packages, along with their descriptions"
    (cons '("_Package Name_" "_Package Description_")
    (sort
     (mapcar
      (lambda (pkg-desc)
        (list (car pkg-desc) (package-desc-summary (cadr pkg-desc))))
      package-alist)
     `(lambda (a b) (string-lessp (car a) (car b))))))

  (got/gen-package-table)
#+END_SRC

#+RESULTS:
| _Package Name_                  | _Package Description_                                                              |
| ac-geiser                       | Auto-complete backend for geiser                                                   |
| ac-slime                        | An auto-complete source using slime completions                                    |
| adoc-mode                       | a major-mode for editing AsciiDoc files in Emacs                                   |
| async                           | Asynchronous processing in Emacs                                                   |
| auto-compile                    | automatically compile Emacs Lisp libraries                                         |
| auto-complete                   | Auto Completion for GNU Emacs                                                      |
| bind-key                        | A simple way to manage personal keybindings                                        |
| cask                            | Cask: Project management for Emacs package development                             |
| cider                           | Clojure Interactive Development Environment that Rocks                             |
| clojure-cheatsheet              | The Clojure Cheatsheet for Emacs                                                   |
| clojure-mode                    | Major mode for Clojure code                                                        |
| clojure-mode-extra-font-locking | Extra font-locking for Clojure mode                                                |
| clojure-snippets                | Yasnippets for clojure                                                             |
| color-theme-sanityinc-tomorrow  | A version of Chris Kempson's "tomorrow" themes                                     |
| company                         | Modular text completion framework                                                  |
| concurrent                      | Concurrent utility functions for emacs lisp                                        |
| ctable                          | Table component for Emacs Lisp                                                     |
| dash                            | A modern list library for Emacs                                                    |
| deferred                        | Simple asynchronous functions for emacs lisp                                       |
| diminish                        | Diminished modes are minor modes with no modeline display                          |
| docker                          | Emacs interface to Docker                                                          |
| docker-api                      | Emacs interface to the Docker API                                                  |
| docker-compose-mode             | Major mode for editing docker-compose files                                        |
| docker-tramp                    | TRAMP integration for docker containers                                            |
| dockerfile-mode                 | Major mode for editing Docker's Dockerfiles                                        |
| drag-stuff                      | Drag stuff (lines, words, region, etc...) around                                   |
| edit-server                     | server that responds to edit requests from Chrome                                  |
| epc                             | A RPC stack for the Emacs Lisp                                                     |
| epl                             | Emacs Package Library                                                              |
| erlang                          | Erlang major mode                                                                  |
| exec-path-from-shell            | Get environment variables such as $PATH from the shell                             |
| expand-region                   | Increase selected region by semantic units.                                        |
| f                               | Modern API for working with files and directories                                  |
| faceup                          | Markup language for faces and font-lock regression testing                         |
| fakir                           | fakeing bits of Emacs                                                              |
| flx                             | fuzzy matching with good sorting                                                   |
| flx-ido                         | flx integration for ido                                                            |
| flycheck                        | On-the-fly syntax checking                                                         |
| flycheck-cask                   | Cask support in Flycheck                                                           |
| flycheck-clojure                | Flycheck: Clojure support                                                          |
| flycheck-pos-tip                | Display Flycheck errors in GUI tooltips                                            |
| flymake-easy                    | Helpers for easily building flymake checkers                                       |
| fsm                             | state machine library                                                              |
| geiser                          | GNU Emacs and Scheme talk to each other                                            |
| ghub                            | minuscule client library for the Github API                                        |
| git-commit                      | Edit Git commit messages                                                           |
| gmail-message-mode              | A major-mode for editing gmail messages using markdown syntax.                     |
| go-mode                         | Major mode for the Go programming language                                         |
| graphviz-dot-mode               | Mode for the dot-language used by graphviz (att).                                  |
| guru-mode                       | Become an Emacs guru                                                               |
| ham-mode                        | Html As Markdown. Transparently edit an html file using markdown                   |
| haskell-mode                    | A Haskell editing mode                                                             |
| helm                            | Helm is an Emacs incremental and narrowing framework                               |
| helm-core                       | Development files for Helm                                                         |
| html-to-markdown                | HTML to Markdown converter written in Emacs-lisp.                                  |
| htmlize                         | Convert buffer text and decorations to HTML.                                       |
| hydra                           | Make bindings that stick around.                                                   |
| idle-highlight-mode             | highlight the word the point is on                                                 |
| ido-completing-read+            | A completing-read-function using ido                                               |
| ido-vertical-mode               | Makes ido-mode display vertically.                                                 |
| jabber                          | A Jabber client for Emacs.                                                         |
| jedi                            | a Python auto-completion for Emacs                                                 |
| jedi-core                       | Common code of jedi.el and company-jedi.el                                         |
| json-mode                       | Major mode for editing JSON files.                                                 |
| json-reformat                   | Reformatting tool for JSON                                                         |
| json-snatcher                   | Grabs the path to JSON values in a JSON file                                       |
| jsx-mode                        | major mode for JSX                                                                 |
| kv                              | key/value data structure functions                                                 |
| macrostep                       | interactive macro expander                                                         |
| magit                           | A Git porcelain inside Emacs.                                                      |
| magit-popup                     | Define prefix-infix-suffix command combos                                          |
| markdown-mode                   | Major mode for Markdown-formatted text                                             |
| markup-faces                    | collection of faces for markup language modes                                      |
| memoize                         | Memoization functions                                                              |
| multiple-cursors                | Multiple cursors for Emacs.                                                        |
| noflet                          | locally override functions                                                         |
| nyan-mode                       | Nyan Cat shows position in current buffer in mode-line.                            |
| oauth2                          | OAuth 2.0 Authorization Protocol                                                   |
| org                             | Outline-based notes management and organizer                                       |
| p4                              | Simple Perforce-Emacs Integration                                                  |
| package-build                   | Tools for assembling a package archive                                             |
| packed                          | package manager agnostic Emacs Lisp package utilities                              |
| paradox                         | A modern Packages Menu. Colored, with package ratings, and customizable.           |
| pkg-info                        | Information about packages                                                         |
| popup                           | Visual Popup User Interface                                                        |
| popwin                          | Popup Window Manager.                                                              |
| pos-tip                         | Show tooltip at point                                                              |
| prodigy                         | Manage external services from within Emacs                                         |
| projectile                      | Manage and navigate projects in Emacs easily                                       |
| python-environment              | virtualenv API for Emacs Lisp                                                      |
| queue                           | Queue data structure                                                               |
| racket-mode                     | Major mode for Racket language.                                                    |
| react-snippets                  | Yasnippets for React                                                               |
| request                         | Compatible layer for URL request in Emacs                                          |
| request-deferred                | Wrap request.el by deferred                                                        |
| restclient                      | An interactive HTTP client for Emacs                                               |
| s                               | The long lost Emacs string manipulation library.                                   |
| shut-up                         | Shut up would you!                                                                 |
| slime                           | Superior Lisp Interaction Mode for Emacs                                           |
| smartparens                     | Automatic insertion, wrapping and paredit-like navigation with user defined pairs. |
| smex                            | M-x interface with Ido-style fuzzy matching.                                       |
| spinner                         | Add spinners and progress-bars to the mode-line for ongoing operations             |
| tablist                         | Extended tabulated-list-mode                                                       |
| twittering-mode                 | Major mode for Twitter                                                             |
| undo-tree                       | Treat undo history as a tree                                                       |
| use-package                     | A configuration macro for simplifying your .emacs                                  |
| web                             | useful HTTP client                                                                 |
| web-mode                        | major mode for editing web templates                                               |
| which-key                       | Display available keybindings in popup                                             |
| with-editor                     | Use the Emacsclient as $EDITOR                                                     |
| yaml-mode                       | Major mode for editing YAML files                                                  |
| yasnippet                       | Yet another snippet extension for Emacs.                                           |

